@echo off
rem -------------------------------------------------------------------
rem LYRDateTime.bat
rem -------------------------------------------------------------------
chcp 1251>NUL

rem -------------------------------------------------------------------
rem ФУНКЦИИ
rem     :LYRDateTime
rem     :YYYYMMDDHHMMSS
rem     :DateTime
rem -------------------------------------------------------------------

:begin
rem Выход из сценария. Дальше - только функции.
:Exit
exit /b 0

rem =================================================
rem ФУНКЦИИ
rem =================================================

rem --------------------------------------------------------------------------------
rem :LYRDateTime
rem --------------------------------------------------------------------------------
:LYRDateTime
rem beginfunction
    rem echo ---------------------------------------------------------------
    rem echo LYRDateTime ...
    rem echo ---------------------------------------------------------------
    set LYRDateTime=LYRDateTime
    echo %LYRDateTime%
    exit /b 0
rem endfunction

rem --------------------------------------------------------------------------------
rem :YYYYMMDDHHMMSS
rem --------------------------------------------------------------------------------
:YYYYMMDDHHMMSS
rem beginfunction
    rem echo ---------------------------------------------------------------
    rem echo YYYYMMDDHHMMSS ...
    rem echo ---------------------------------------------------------------
    set YYYYMMDDHHMMSS=""
    echo %YYYYMMDDHHMMSS%
    exit /b 0
rem endfunction

rem --------------------------------------------------------------------------------
rem :DateTime
rem --------------------------------------------------------------------------------
:DateTime
rem beginfunction
    rem echo ---------------------------------------------------------------
    rem echo DateTime ...
    rem echo ---------------------------------------------------------------
    set DateTime=""
    echo %DateTime%
    exit /b 0
rem endfunction
