#!/bin/bash
# -----------------------------------------------
# LYRSupport.sh
# -----------------------------------------------

#:begin
# echo '01.НАЗВАНИЕ'
# echo '    *** - ***'

# echo '02.СИНТАКСИС'
# echo '    *** [параметры] ***'

# echo '03.ОПИСАНИЕ'
# echo '    ***'

#--------------------------------------------------------------------------------
# 
#--------------------------------------------------------------------------------
function LYRSupport { #
#beginfunction
    echo LYRSupport
}
#endfunction

#:Exit
