@echo off
rem -------------------------------------------------------------------
rem LYRSupport.bat
rem -------------------------------------------------------------------
chcp 1251>NUL

rem -------------------------------------------------------------------
rem ФУНКЦИИ
rem     :LYRSupport
rem -------------------------------------------------------------------

:begin
rem Выход из сценария. Дальше - только функции.
:Exit
exit /b 0

rem =================================================
rem ФУНКЦИИ
rem =================================================

rem --------------------------------------------------------------------------------
rem :LYRSupport
rem --------------------------------------------------------------------------------
:LYRSupport
rem beginfunction
    rem echo ---------------------------------------------------------------
    rem echo LYRSupport ...
    rem echo ---------------------------------------------------------------
    set LYRSupport=LYRSupport
    echo %LYRSupport%
    exit /b 0
rem endfunction

:Check_P
echo ---------------------------------------------------------------
echo Check_P [P_Name,P_Value]
echo ---------------------------------------------------------------
set P_Name=%1
echo P_Name: %P_Name%
set P_Value=%2
echo P_Value: %P_Value%
rem set %P%=TEST3
if %P_Value%=="" (
    rem set /p %P_Name%="%P_Name%":
    set %P_Name%=TEST1
) else (
    set %P_Name%=%P_Value%
)
if %P_Value%=="" (
    set %P_Name%=TEST2
)
echo P_Name: %P_Name%
exit /b 0

:__Check_P1
echo ---------------------------------------------------------------
echo __Check_P1 [P1]
echo ---------------------------------------------------------------
if "%1"=="" (
    rem set /p P1=P1:
    set P1=""
) else (
    set P1=%1
)
if "%P1%"=="" (
    set P1=""
)
echo P1: %P1%
exit /b 0

rem ===================================================================
