@echo off
rem -------------------------------------------------------------------
rem 
rem -------------------------------------------------------------------
chcp 1251

rem -------------------------------------------------------------------
:P1
if "%1" == "" goto P1_Input
goto P1_Error
:P1_Input
set /p R=Разделитель:
if "%R%" == "" goto begin
goto Begin
:P1_Error
echo Значение параметра GlobalRepository не установлено
goto begin
rem -------------------------------------------------------------------

:begin
mkdir %date:~6,4%%R%%date:~3,2%%R%%date:~0,2%

:Exit
