@echo off
rem -------------------------------------------------------------------
rem 
rem -------------------------------------------------------------------
chcp 1251>NUL

:begin

call :Check_P1 || exit /b 1

mkdir %date:~6,4%%R%%date:~3,2%%R%%date:~0,2%

rem Выход из сценария. Дальше - только функции.
:Exit
exit /b 0

:Exit

rem =================================================
rem ФУНКЦИИ
rem =================================================
:Check_P1
echo ---------------------------------------------------------------
echo Check_P1 [R]
echo ---------------------------------------------------------------
if "%1"=="" (
    rem set /p R=Разделитель:
    set R=""
) else (
    set R=%1
)
if "%P1%"=="" (
    set R=""
)
echo R: %R%
exit /b 0
