@echo off
rem -------------------------------------------------------------------
rem 
rem -------------------------------------------------------------------
chcp 1251>NUL

:begin

call :Check_P1 || exit /b 1

mkdir %date:~6,4%%P1%%date:~3,2%%P1%%date:~0,2%

rem Выход из сценария. Дальше - только функции.
:Exit
exit /b 0

rem =================================================
rem ФУНКЦИИ
rem =================================================
:Check_P1
echo ---------------------------------------------------------------
echo Check_P1 [P1_Value]
echo ---------------------------------------------------------------
if "%1"=="" (
    set P1=""
    rem set /p P1=P1:
) else (
    set P1=%1
    exit /b 0
)
if "%P1%"=="" (
    set P1=""
)
echo P1: %P1%
exit /b 0
